List<String> verbs = [
  'لعب', 'أكل', 'كتاب', 'قفز', 'نوم', 'جري', 'غناء', 'حديث', 'رسم', 'عمل',
  'سباحة', 'طبخ', 'غسيل', 'غطس', 'حركة', 'خطوة', 'تسلق', 'مرحبا', 'متجر','ذهب'
];

List<String> jobs = [
  'طبيب', 'مهندس', 'فنان', 'مغني', 'فلاح', 'خباز', 'ممثل',
  'ممرضة', 'طيار', 'طباخ', 'مدرب', 'سائق', 'رقص', 'حارس', 'محامي',
  'sailor', 'teacher'
];

List<String> foodAndDrinks = [
  'مياه', 'عصير', 'حليب', 'خبز', 'تفاحة', 'فطيرة', 'لحوم', 'خضار', 'سمك',
  'دجاج', 'برتقال', 'بطاطس', 'كعكة', 'شاي', 'قهوة', 'ارز', 'فول',
  'جبن'
];

List<String> places = [
  'مدرسة', 'حديقة', 'بحر', 'مطعم', 'متحف', 'مستشفي', 'رياضة',
  'فندق', 'منزل', 'حقل', 'معسكر', 'نهر', 'تجارة', 'بنك', 'سينيما', 'محطة'
];

List<String> transportations = [
  'قطار', 'حافلة', 'سيارة', 'دراجة', 'سفينة', 'مترو'
];

List<String> animals = [
  'كلب', 'قطة', 'اسد', 'فيل', 'نمر', 'دب', 'حمار', 'قرد', 'فهد', 'زرافة',
  'ثعلب', 'ارنب', 'غزال', 'حصان'
];


List<String> easyArabicWords = [...verbs, ...jobs, ...foodAndDrinks, ...places, ...transportations, ...animals];