import 'package:hang_man/models/random_word.dart';

List<RandomWord> verbs = [
  RandomWord(word: 'لعب', hints: "المشاركة في النشاط للتمتع والترفيه."),
  RandomWord(word: 'أكل', hints: "تناول الطعام للتغذية."),
  RandomWord(word: 'كتاب', hints: "النظر وفهم معنى الكلمات المكتوبة أو المطبوعة عن طريق تفسير الحروف أو الرموز."),
  RandomWord(word: 'قفز', hints: "دفع الشخص نفسه بعيدًا عن الأرض باستخدام عضلاته، عادة بطريقة سريعة وقوية."),
  RandomWord(word: 'نوم', hints: "الراحة بعيون مغلقة في حالة من اللاوعي الطبيعي."),
  RandomWord(word: 'جري', hints: "التحرك بسرعة أكبر من المشي عن طريق تحريك الأرجل بشكل أسرع."),
  RandomWord(word: 'حديث', hints: "التحدث لإعطاء معلومات أو التعبير عن الأفكار أو المشاعر."),
  RandomWord(word: 'رسم', hints: "إنتاج صورة أو رسم بياني عن طريق وضع خطوط وعلامات على الورق بواسطة قلم رصاص أو قلم."),
  RandomWord(word: 'عمل', hints: "المشاركة في نشاط يتضمن جهدًا ذهنيًا أو جسديًا تم بغرض تحقيق هدف أو نتيجة."),
  RandomWord(word: 'سباحة', hints: "دفع الشخص نفسه عبر الماء باستخدام الأطراف."),
  RandomWord(word: 'طبخ', hints: "تحضير الطعام أو طبق أو وجبة عن طريق مزج وتسخين المكونات."),
  RandomWord(word: 'غسيل', hints: "تنظيف بالماء وعادة مع الصابون أو المنظف."),
  RandomWord(word: 'غطس', hints: "الانغماس برأس أولاً في الماء."),
  RandomWord(word: 'حركة', hints: "ضرب أو دفع بقوة بالقدم."),
  RandomWord(word: 'خطوة', hints: "التحرك برفق من قدم إلى أخرى بقفزة أو قفزة."),
  RandomWord(word: 'تسلق', hints: "الصعود بتدريج أو بحركة مستمرة."),
  RandomWord(word: 'مرحبا', hints: "تحية شخص ما أو لفت انتباهه."),
  RandomWord(word: 'متجر', hints: "شراء السلع أو الخدمات من متجر أو عمل تجاري."),
  RandomWord(word: 'ذهب', hints: "التنقل من مكان إلى آخر؛ السفر."),
];

List<RandomWord> jobs = [
  RandomWord(word: 'طبيب', hints: "شخص مرخص لممارسة الطب، غالبًا ما يتخصص في مجالات معينة من الرعاية الصحية."),
  RandomWord(word: 'مهندس', hints: "شخص يقوم بتصميم وبناء أو صيانة المحركات والآلات والهياكل أو الأعمال العامة."),
  RandomWord(word: 'فنان', hints: "شخص يقوم بإنشاء فن، باستخدام خياله ومهاراته لإنتاج أعمال تعبر عن العواطف أو الأفكار أو الجمال."),
  RandomWord(word: 'مغني', hints: "شخص يستخدم صوته كآلة لأداء الأغاني أو الموسيقى الصوتية."),
  RandomWord(word: 'فلاح', hints: "شخص يعمل في الزراعة، عادةً بزراعة المحاصيل وتربية الماشية."),
  RandomWord(word: 'خباز', hints: "شخص يخبز ويبيع الخبز والكعك والمعجنات."),
  RandomWord(word: 'ممثل', hints: "شخص يجسد شخصية في أداء، مثل في مسرحية أو فيلم أو برنامج تلفزيوني."),
  RandomWord(word: 'ممرضة', hints: "محترف الرعاية الصحية الذي يهتم بالأفراد والعائلات والمجتمعات لتعزيز الصحة ومنع المرض."),
  RandomWord(word: 'طيار', hints: "شخص يدير طائرة، سواء كقبطان أو ضابط أول."),
  RandomWord(word: 'طباخ', hints: "طباخ محترف ماهر في تحضير الطعام."),
  RandomWord(word: 'مدرب', hints: "شخص يدرب ويوجه فريق رياضي أو رياضيين فرديين."),
  RandomWord(word: 'نجار', hints: "شخص يعمل في تشكيل وتصنيع الأشياء من الخشب."),
  RandomWord(word: 'رقص', hints: "شخص يتحرك بإيقاع للموسيقى، عادةً باتباع نمط مرتبط بالرقص."),
  RandomWord(word: 'حارس', hints: "شخص يحمي شخصًا ما أو شيئًا ما من الخطر أو الهجوم."),
  RandomWord(word: 'محامي', hints: "شخص يمارس أو يدرس القانون، عادةً كمحام أو مستشار قانوني."),
  RandomWord(word: 'قبطان', hints: "شخص يعمل على سفينة أو قارب، خاصة من هو مسؤول عن الإبحار والملاحة."),
  RandomWord(word: 'معلم', hints: "شخص يعلم الطلاب في مدرسة أو مؤسسة تعليمية أخرى."),
];

List<RandomWord> foodAndDrinks = [
  RandomWord(word: 'مياه', hints: "سائل لا لون له ولا رائحة وطعمه عادة طبيعي."),
  RandomWord(word: 'عصير', hints: "سائل من الفواكه أو الخضروات، غالبًا ما يكون منعشًا."),
  RandomWord(word: 'حليب', hints: "سائل أبيض غذائي يفرز من الغدد الثديية للثدييات."),
  RandomWord(word: 'خبز', hints: "طعام مصنوع من عجينة مخمرة تعتمد على دقيق الحبوب."),
  RandomWord(word: 'تفاحة', hints: "ثمرة بشرية من نوع التفاح."),
  RandomWord(word: 'فطيرة', hints: "حلوى مخبوزة مع حشوة داخلية."),
  RandomWord(word: 'لحوم', hints: "أنواع مختلفة من اللحوم المصنوعة من الحيوانات."),
  RandomWord(word: 'خضار', hints: "النباتات التي تؤكل كجزء من الوجبات."),
  RandomWord(word: 'سمك', hints: "حيوان مائي يستخدم عادة في الطهي."),
  RandomWord(word: 'دجاج', hints: "طيور الدجاج التي تستخدم عادة للتغذية."),
  RandomWord(word: 'برتقال', hints: "ثمرة حمضية ذات لون برتقالي."),
  RandomWord(word: 'بطاطس', hints: "نبات ذو نشا يؤكل عادة كجزء من الوجبات."),
  RandomWord(word: 'كعكة', hints: "حلوى مخبوزة غالبًا ما تكون طبقات مع كريمة."),
  RandomWord(word: 'شاي', hints: "مشروب يتم تحضيره بتخمير أوراق الشاي."),
  RandomWord(word: 'قهوة', hints: "مشروب ساخن مصنوع من حبوب البن."),
  RandomWord(word: 'ارز', hints: "حبوب معمرة تعتبر غذاءً أساسيًا في بعض المجتمعات."),
  RandomWord(word: 'فول', hints: "نوع من البقوليات ذات البذور المدورة."),
  RandomWord(word: 'جبن', hints: "منتج من التخمير أو التجفيف أو تجفيف الحليب."),
];

List<RandomWord> places = [
  RandomWord(word: 'مدرسة', hints: "مؤسسة تعليمية حيث يتلقى الطلاب التعليم."),
  RandomWord(word: 'حديقة', hints: "مساحة خضراء مصممة للاسترخاء والترفيه."),
  RandomWord(word: 'بحر', hints: "كتلة كبيرة من الماء المالح التي تغطي الأرض."),
  RandomWord(word: 'مطعم', hints: "مكان يقدم الطعام للزبائن."),
  RandomWord(word: 'متحف', hints: "مؤسسة تحتوي على مجموعة من القطع الفنية أو التاريخية."),
  RandomWord(word: 'مستشفى', hints: "مؤسسة طبية تقدم الرعاية الصحية للمرضى."),
  RandomWord(word: 'رياضة', hints: "نشاط بدني يهدف إلى تحسين اللياقة البدنية."),
  RandomWord(word: 'فندق', hints: "مبنى يوفر الإقامة والخدمات للنزلاء."),
  RandomWord(word: 'منزل', hints: "مكان يعيش فيه الأفراد ويعتبر مأوى لهم."),
  RandomWord(word: 'حقل', hints: "مساحة من الأرض مخصصة لزراعة المحاصيل."),
  RandomWord(word: 'معسكر', hints: "مكان مؤقت للإقامة في الهواء الطلق."),
  RandomWord(word: 'نهر', hints: "تيار مائي طبيعي يتدفق في الأرض."),
  RandomWord(word: 'تجارة', hints: "أنشطة اقتصادية تتضمن بيع وشراء السلع والخدمات."),
  RandomWord(word: 'بنك', hints: "مؤسسة مالية تقدم خدمات مثل التوفير والإقراض."),
  RandomWord(word: 'سينما', hints: "مكان يعرض الأفلام للجمهور."),
  RandomWord(word: 'محطة', hints: "مكان حيث يتم توقف وصول ومغادرة وسائل النقل."),
];

List<RandomWord> transportations = [
  RandomWord(word: 'قطار', hints: "وسيلة نقل برية تسير على قضبان حديدية."),
  RandomWord(word: 'حافلة', hints: "مركبة كبيرة لنقل عدد كبير من الركاب."),
  RandomWord(word: 'سيارة', hints: "مركبة آلية تستخدم لنقل الأفراد والبضائع."),
  RandomWord(word: 'دراجة', hints: "وسيلة نقل خفيفة تتكون من إطارين ومقود."),
  RandomWord(word: 'سفينة', hints: "وسيلة نقل مائية كبيرة تستخدم للملاحة البحرية."),
  RandomWord(word: 'مترو', hints: "نظام نقل سريع تحت الأرض أو فوقها في المدن الكبرى."),
];

List<RandomWord> animals = [
  RandomWord(word: 'كلب', hints: "حيوان أليف معروف بولائه للإنسان."),
  RandomWord(word: 'قطة', hints: "حيوان أليف صغير الحجم، معروف بحبه للعب."),
  RandomWord(word: 'اسد', hints: "ملك الغابة، حيوان مفترس يعيش في إفريقيا."),
  RandomWord(word: 'فيل', hints: "أكبر حيوان بري، معروف بخرطومه الكبير."),
  RandomWord(word: 'نمر', hints: "حيوان مفترس ذو فرو مخطط، يعيش في آسيا."),
  RandomWord(word: 'دب', hints: "حيوان ضخم يتغذى على اللحوم والنباتات."),
  RandomWord(word: 'حمار', hints: "حيوان يستخدم في النقل والزراعة، معروف بصبره."),
  RandomWord(word: 'قرد', hints: "حيوان ذكي يعيش في الأشجار، يتميز بقدراته على التسلق."),
  RandomWord(word: 'فهد', hints: "أسرع حيوان بري، يتميز بلونه البني الفاتح."),
  RandomWord(word: 'زرافة', hints: "أطول حيوان بري، تتميز بعنقها الطويل."),
  RandomWord(word: 'ثعلب', hints: "حيوان صغير الحجم، معروف بذكائه ومكره."),
  RandomWord(word: 'ارنب', hints: "حيوان صغير ذو أذنين طويلتين، يعيش في الجحور."),
  RandomWord(word: 'غزال', hints: "حيوان بري رشيق، معروف بسرعته وخفته."),
  RandomWord(word: 'حصان', hints: "حيوان قوي يستخدم في الركوب والنقل."),
  RandomWord(word: 'خروف', hints: "حيوان مستأنس، معروف بصوفه الأبيض."),
];


List<RandomWord> easyArabicWords = [...verbs, ...jobs, ...foodAndDrinks, ...places, ...transportations, ...animals];